src/Documents/ПланЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПланЛечения</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланыЛечения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыОплат</Name>
					<Comment>Виды оплат</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Лечение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зуб</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Зубы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прием</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакВыбора</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАвтоматическойСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиНаценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСкидки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакОплатыБонусом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Comment>Серия сертификата</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПодарочногоСертификата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОтветственногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтветственныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПланыЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ПланыЛечения</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КлючСтроки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Зуб</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПриема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПланЛечения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаПланЛечения, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ВидДвижения,
	|	ПланЛеченияЛечение.КлючСтроки,
	|	ПланЛеченияЛечение.НомерПриема,
	|	ПланЛеченияЛечение.Ссылка.Дата КАК Период,
	|	ПланЛеченияЛечение.Зуб,
	|	ПланЛеченияЛечение.Номенклатура,
	|	ПланЛеченияЛечение.Ссылка.СтруктурнаяЕдиница,
	|	ПланЛеченияЛечение.Ссылка.Контрагент,
	|	СУММА(ПланЛеченияЛечение.Количество) КАК Количество,
	|	СУММА(ПланЛеченияЛечение.Сумма) КАК Сумма,
	|	ПланЛеченияЛечение.Ссылка
	|ПОМЕСТИТЬ ВременнаяТаблицаПланЛечения
	|ИЗ
	|	Документ.ПланЛечения.Лечение КАК ПланЛеченияЛечение
	|ГДЕ
	|	ПланЛеченияЛечение.Ссылка = &Ссылка
	|	И НЕ ПланЛеченияЛечение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Отвергнут)
	|	И ВЫБОР
	|			КОГДА ПланЛеченияЛечение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланЛечения.Закрыт)
	|				ТОГДА НЕ ПланЛеченияЛечение.Прием = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланЛеченияЛечение.КлючСтроки,
	|	ПланЛеченияЛечение.Номенклатура,
	|	ПланЛеченияЛечение.Ссылка,
	|	ПланЛеченияЛечение.Ссылка.СтруктурнаяЕдиница,
	|	ПланЛеченияЛечение.Ссылка.Контрагент,
	|	ПланЛеченияЛечение.Ссылка.Дата,
	|	ПланЛеченияЛечение.Зуб,
	|	ПланЛеченияЛечение.НомерПриема";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПланЛечения);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаПланЛечения(ДокументСсылкаПланЛечения, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПланЛечения(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаПланЛечения.КлючСтроки,
	|	ВременнаяТаблицаПланЛечения.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаПланЛечения.Контрагент,
	|	ВременнаяТаблицаПланЛечения.НомерПриема,
	|	ВременнаяТаблицаПланЛечения.Зуб,
	|	ВременнаяТаблицаПланЛечения.Номенклатура,
	|	ВременнаяТаблицаПланЛечения.Ссылка КАК ПланЛечения,
	|	ВременнаяТаблицаПланЛечения.Количество,
	|	ВременнаяТаблицаПланЛечения.Сумма,
	|	ВременнаяТаблицаПланЛечения.Период,
	|	ВременнаяТаблицаПланЛечения.ВидДвижения
	|ИЗ
	|	ВременнаяТаблицаПланЛечения КАК ВременнаяТаблицаПланЛечения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПланыЛечения", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

#КонецОбласти

#Область ДополнительныеПроцедурыФункции

// Вернуть ФИО ответственного лица организации
Функция ВернутьФИООтветственныеЛицаОрганизации(Организация)
	
	Запрос = Новый запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаСрезПоследних.Сотрудник.Наименование КАК ФИО,
	|	ОтветственныеЛицаСрезПоследних.ТипОтветственногоЛица  КАК ТипОтветственногоЛица
	|ИЗ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних(
	|			,
	|			ТипОтветственногоЛица = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственныхЛиц.ГлавныйБухгалтер)
	|				ИЛИ ТипОтветственногоЛица = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственныхЛиц.Руководитель)
	|					И Организация = &Организация) КАК ОтветственныеЛицаСрезПоследних");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция возвращает остаток указанной услуги по регистру "Планы лечения".
//
Функция ОстатокУслугПоПлануЛечения(Номенклатура, Контрагент, Зуб, СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланыЛеченияОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ПланыЛечения.Остатки(&ТекущаяДата, ) КАК ПланыЛеченияОстатки
	|ГДЕ
	|	ПланыЛеченияОстатки.Номенклатура = &Номенклатура
	|	И ПланыЛеченияОстатки.Контрагент = &Контрагент
	|	И ПланыЛеченияОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ПланыЛеченияОстатки.Зуб = &Зуб");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Зуб", Зуб);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции	

#КонецОбласти

#Область Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПланЛечения") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПланЛечения", "План лечения финансовый", СформироватьПечатнуюФормуПланЛечения(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПланЛеченияМед") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПланЛеченияМед", "План лечения медицинский", СформироватьПечатнуюФормуПланЛеченияМедицинский(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры // Печать()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ
// Функция, возвращающая табличный документ "Счет на оплату" для печати
//
Функция СформироватьПечатнуюФормуПланЛечения(МассивОбъектов, ОбъектыПечати)
	
	Если ИспользуетсяПользовательскийМакет("ПФ_MXL_ПланЛечения") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание используется пользовательский макет печати. Рекомендуется использовать оригинальный макет.");
	КонецЕсли;
	ТабДокумент   = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_MXL_ПланЛечения";
	Макет = УправлениеПечатью.ТабличныйДокументПоДвоичнымДанным(УправлениеПечатью.МакетПечатнойФормы("Документ.ПланЛечения.ПФ_MXL_ПланЛечения"));
	
	ПервыйДокумент    = Истина;
	
	Для Каждого Объект Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;	
		
		ЭтоСтоматологическиеУслуги = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(Объект.Сотрудник); 
			
		ЗапросШапка = Новый Запрос;
		ЗапросШапка.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
		ЗапросШапка.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплату.Номер КАК Номер,
		|	СчетНаОплату.Дата КАК Дата,
		|	СчетНаОплату.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
		|	СчетНаОплату.СуммаДокумента КАК СуммаДокумента,
		|	СчетНаОплату.СтруктурнаяЕдиница.Организация КАК Организация,
		|	СчетНаОплату.Контрагент КАК Получатель,
		|	СчетНаОплату.Сотрудник КАК Поставщик,
		|	СчетНаОплату.Ссылка
		|ИЗ
		|	Документ.ПланЛечения КАК СчетНаОплату
		|ГДЕ
		|	СчетНаОплату.Ссылка = &ТекущийДокумент";
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ЗапросУслуги = Новый Запрос;
		ЗапросУслуги.УстановитьПараметр("Ссылка", Объект.Ссылка);
		ЗапросУслуги.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПланЛеченияЛечение.Зуб КАК Зуб,
		|	ПланЛеченияЛечение.Номенклатура КАК Номенклатура,
		|	СУММА(ПланЛеченияЛечение.Сумма) КАК Сумма,
		|	СУММА(ЕСТЬNULL(ПланЛеченияЛечение.Количество, 0)) КАК Количество,
		|	ПланЛеченияЛечение.НомерПриема КАК НомерПриема,
		|	ЕСТЬNULL(ПланЛеченияЛечение.Цена, 0) КАК Цена,
		|	ПланЛеченияЛечение.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ПланЛеченияЛечение.СуммаНДС) КАК СуммаНДС,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена - ПланЛеченияЛечение.Сумма = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена / 100 <> 0
		|						ТОГДА (ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена - ПланЛеченияЛечение.Сумма) / (ПланЛеченияЛечение.Количество * ПланЛеченияЛечение.Цена / 100)
		|				КОНЕЦ
		|		КОНЕЦ) КАК ПроцентСкидкиНаценки,
		|	СУММА(ПланЛеченияЛечение.СуммаАвтоматическойСкидкиНаценки) КАК СуммаАвтоматическойСкидкиНаценки,
		|	ПланЛеченияЛечение.Номенклатура.КодНоменклатурыМедицинскиУслуг КАК Артикул,
		|	ПланЛеченияЛечение.НомерСтроки КАК НомерСтроки,
		|	СУММА(ПланЛеченияЛечение.Цена * ПланЛеченияЛечение.Количество) КАК СуммаБезСкидки
		|ИЗ
		|	Документ.ПланЛечения.Лечение КАК ПланЛеченияЛечение
		|ГДЕ
		|	ПланЛеченияЛечение.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланЛеченияЛечение.Зуб,
		|	ПланЛеченияЛечение.Номенклатура,
		|	ПланЛеченияЛечение.НомерПриема,
		|	ПланЛеченияЛечение.СтавкаНДС,
		|	ПланЛеченияЛечение.Номенклатура.КодНоменклатурыМедицинскиУслуг,
		|	ПланЛеченияЛечение.Цена,
		|	ПланЛеченияЛечение.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(Количество),
		|	СУММА(СуммаНДС),
		|	СУММА(ПроцентСкидкиНаценки),
		|	СУММА(СуммаАвтоматическойСкидкиНаценки),
		|	СУММА(СуммаБезСкидки)
		|ПО
		|	НомерПриема,
		|	Номенклатура"; 	
		
		ТаблицаЛечение 			= ЗапросУслуги.Выполнить().Выгрузить();
		ВыборкаТаблицаЛечение 	= ЗапросУслуги.Выполнить();
		
		// Вывод реквизитов организации
		Если Макет.Области.Найти("РеквизитыОрганизации") <> Неопределено Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыОрганизации");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ПредставлениеОрганизации") Тогда 
				ПолноеПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,");
				ПредставлениеОрганизации       = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Шапка.Организация, "Наименование");
				ОбластьМакета.Параметры.ПредставлениеОрганизации = ?(ЗначениеЗаполнено(ПолноеПредставлениеОрганизации), ПолноеПредставлениеОрганизации, ПредставлениеОрганизации); 			
			КонецЕсли;
			
			ФактАдрес = Шапка.Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, "Вид");
			ЮрАдрес   = Шапка.Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
			
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "АдресОрганизации") Тогда
				
				Если НЕ ФактАдрес = Неопределено Тогда
					Адрес = ФактАдрес.Представление;
				ИначеЕсли НЕ ЮрАдрес = Неопределено Тогда
					Адрес = ЮрАдрес.Представление;
				КонецЕсли;
 
				ОбластьМакета.Параметры.АдресОрганизации = ?(ЗначениеЗаполнено(Адрес), Адрес, ""); 
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ВидыВыводимойКИ = Новый Массив;
		ВидыВыводимойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		ВидыВыводимойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации);
		ВидыВыводимойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
		
		Для Каждого ВидКонтактнойИнформации Из ВидыВыводимойКИ Цикл
			
			СтрокаКИ = Шапка.Организация.КонтактнаяИнформация.Найти(ВидКонтактнойИнформации, "Вид");		
			Если СтрокаКИ <> Неопределено Тогда		
				Если Макет.Области.Найти("СтрокаКИ") <> Неопределено Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКИ");
					Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ВидКИ") Тогда
						ОбластьМакета.Параметры.ВидКИ = СтрокаКИ.Вид;
					КонецЕсли;
					Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ПредставлениеКИ") Тогда
						ОбластьМакета.Параметры.ПредставлениеКИ = СокрП(СтрокаКИ.Представление);				
					КонецЕсли;
					ТабДокумент.Вывести(ОбластьМакета);				
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;
		// ***
		Если Макет.Области.Найти("Заголовок") <> Неопределено Тогда
			ОбластьМакета                          = Макет.ПолучитьОбласть("Заголовок");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ТекстЗаголовка") Тогда
				ОбластьМакета.Параметры.ТекстЗаголовка = "План лечения № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс) + " от " + Формат(Шапка.Дата, "ДФ='дд ММММ гггг'") + " г.";	
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		Если Макет.Области.Найти("Покупатель") <> Неопределено Тогда
			ОбластьМакета           = Макет.ПолучитьОбласть("Покупатель");
			ПредставлениеПолучателя = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Шапка.Получатель, "Наименование");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ПредставлениеПолучателя") Тогда
				ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		Если Макет.Области.Найти("Составитель") <> Неопределено Тогда
			ОбластьМакета                                    = Макет.ПолучитьОбласть("Составитель");
			ПредставлениеСоставителя                         = Объект.Сотрудник;
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ПредставлениеСоставителя") Тогда
				ОбластьМакета.Параметры.ПредставлениеСоставителя = ПредставлениеСоставителя;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		//===================================================ВЫВОД ТАБЛИЦЫ ЛЕЧЕНИЕ=======================================================	
		ЕстьСкидки = ТаблицаЛечение.Итог("ПроцентСкидкиНаценки") <> 0 ИЛИ ТаблицаЛечение.Итог("СуммаАвтоматическойСкидкиНаценки") <> 0;
		ИтогоСуммаБезСкидки = 0;
		Если ЕстьСкидки Тогда 
			Если Макет.Области.Найти("ШапкаТаблицыСоСкидкой") <> Неопределено Тогда
				ОбластьШапкаТаблицы         = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой");
				ТабДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;
			БезСкидкиИтого = 0;
			СкидкаИтого = 0;
			СумИтого = 0;
			НДСИтого = 0;
			Таблица = Новый ТаблицаЗначений; 
			ОписаниеКоличество = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3));
			Таблица.Колонки.Добавить("Зуб");
			Таблица.Колонки.Добавить("Номенклатура");
			Таблица.Колонки.Добавить("Количество", ОписаниеКоличество);
			Таблица.Колонки.Добавить("Цена", ОписаниеКоличество);
			Таблица.Колонки.Добавить("Сумма", ОписаниеКоличество);
			Таблица.Колонки.Добавить("СуммаНДС", ОписаниеКоличество);
			Таблица.Колонки.Добавить("СтавкаНДС");
			Таблица.Колонки.Добавить("НомерПриема");
			Таблица.Колонки.Добавить("Артикул");
			Таблица.Колонки.Добавить("СуммаБезСкидки", ОписаниеКоличество);
			Таблица.Колонки.Добавить("Скидка", ОписаниеКоличество);
			Таблица.Колонки.Добавить("ПроцентСкидки");
			
			ВыборкаИтог = ЗапросУслуги.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 		
			
			Пока ВыборкаИтог.Следующий() Цикл		
				
				ВыборкаНоменклатура = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Если Макет.Области.Найти("НомерПриема") <> Неопределено Тогда
					ОбластьНомерСтроки          = Макет.ПолучитьОбласть("НомерПриема");
					Если ЕстьПараметрОбласти(ОбластьНомерСтроки.Параметры, "НомерПриема") Тогда
						ОбластьНомерСтроки.Параметры.НомерПриема = ?(ВыборкаИтог.НомерПриема <> 0, "" + ВыборкаИтог.НомерПриема + " посещение", "");	
					КонецЕсли;
					Если ЕстьПараметрОбласти(ОбластьНомерСтроки.Параметры, "Сумма") Тогда
						ОбластьНомерСтроки.Параметры.Сумма = ?(ВыборкаИтог.Сумма <> 0, Формат(ВыборкаИтог.Сумма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00"),"");
					КонецЕсли;
					ТабДокумент.Вывести(ОбластьНомерСтроки, ВыборкаИтог.Уровень());	
				КонецЕсли;
				
				Пока ВыборкаНоменклатура.Следующий() Цикл
					
					НоваяСтрока             	= Таблица.Добавить();
					НоваяСтрока.Артикул 		= ВыборкаНоменклатура.Артикул;
					НоваяСтрока.Номенклатура 	= ВыборкаНоменклатура.Номенклатура;
					НоваяСтрока.Количество   	= ВыборкаНоменклатура.Количество;
					НоваяСтрока.СуммаБезСкидки	= ВыборкаНоменклатура.СуммаБезСкидки;
					НоваяСтрока.Цена   			= ВыборкаНоменклатура.СуммаБезСкидки / ?(ВыборкаНоменклатура.Количество <> 0, ВыборкаНоменклатура.Количество, 1);
					НоваяСтрока.СуммаНДС   		= ВыборкаНоменклатура.СуммаНДС;
					НоваяСтрока.Скидка          = ВыборкаНоменклатура.СуммаБезСкидки - ВыборкаНоменклатура.Сумма;
					НоваяСтрока.Сумма   		= ВыборкаНоменклатура.Сумма;
					
					Если НоваяСтрока.Сумма = 0
						ИЛИ НоваяСтрока.СуммаБезСкидки = 0 Тогда
						НоваяСтрока.ПроцентСкидки = 0;
					Иначе	
						НоваяСтрока.ПроцентСкидки = 100 - (НоваяСтрока.Сумма/НоваяСтрока.СуммаБезСкидки)*100;	
					КонецЕсли;
					
					ВыборкаСтавкаНДС = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСтавкаНДС.Следующий() Цикл
						НоваяСтрока.СтавкаНДС = ВыборкаСтавкаНДС.СтавкаНДС;
					КонецЦикла;
					
					Если НоваяСтрока.СуммаНДС = 0 Тогда
						НоваяСтрока.СтавкаНДС = "Без НДС";
					КонецЕсли;
					
					БезСкидкиИтого 	= БезСкидкиИтого + НоваяСтрока.СуммаБезСкидки;
					СкидкаИтого 	= СкидкаИтого + НоваяСтрока.Скидка;
					НДСИтого		= НДСИтого + ВыборкаНоменклатура.СуммаНДС;
					СумИтого 		= СумИтого + ВыборкаНоменклатура.Сумма;
					ВыборкаЗубы 	= ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.Прямой);			
					
					СписокЗначений = Новый СписокЗначений;
					Пока ВыборкаЗубы.Следующий() Цикл
						
						СписокЗначений.Добавить(Строка(ВыборкаЗубы.Зуб));				
						
					КонецЦикла;
					
					СписокЗначений.СортироватьПоЗначению();
					Зубы = "";
					Разделитель = "";
					
					Для Каждого СтрокаСЗ ИЗ СписокЗначений Цикл
						
						Зубы = Зубы + Разделитель + СтрокаСЗ.Значение;
						Разделитель = ",";				
						
					КонецЦикла;  			
					
					НоваяСтрока.Зуб = Зубы; 
					
					Если Макет.Области.Найти("НоменклатураСоСкидкой") <> Неопределено Тогда
						ОбластьНоменклатура         = Макет.ПолучитьОбласть("НоменклатураСоСкидкой");      
						
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Количество") Тогда
							ОбластьНоменклатура.Параметры.Количество 	= НоваяСтрока.Количество;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Зуб") Тогда
							ОбластьНоменклатура.Параметры.Зуб 			= НоваяСтрока.Зуб;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Номенклатура") Тогда
							ОбластьНоменклатура.Параметры.Номенклатура 	=?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура.НаименованиеПолное),НоваяСтрока.Номенклатура.НаименованиеПолное, НоваяСтрока.Номенклатура);
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Цена") Тогда
							ОбластьНоменклатура.Параметры.Цена 			= НоваяСтрока.Цена;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Сумма") Тогда
							ОбластьНоменклатура.Параметры.Сумма 		= НоваяСтрока.Сумма;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "СуммаНДС") Тогда
							ОбластьНоменклатура.Параметры.СуммаНДС 		= НоваяСтрока.СуммаНДС;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "СтавкаНДС") Тогда
							ОбластьНоменклатура.Параметры.СтавкаНДС 	= НоваяСтрока.СтавкаНДС;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "ПроцентСкидки") Тогда
							ОбластьНоменклатура.Параметры.ПроцентСкидки = НоваяСтрока.ПроцентСкидки;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "СуммаБезСкидки") Тогда
							ОбластьНоменклатура.Параметры.СуммаБезСкидки = НоваяСтрока.СуммаБезСкидки;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Скидка") Тогда
							ОбластьНоменклатура.Параметры.Скидка 		= НоваяСтрока.Скидка;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Артикул") Тогда
							ОбластьНоменклатура.Параметры.Артикул 		= НоваяСтрока.Артикул;
						КонецЕсли;
						
						ТабДокумент.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла; 
			
			Если Макет.Области.Найти("Итого") <> Неопределено Тогда
				ОбластьИтого                = Макет.ПолучитьОбласть("Итого");                      
				Если ЕстьПараметрОбласти(ОбластьИтого.Параметры, "СуммаБезСкидки") Тогда
					ОбластьИтого.Параметры.СуммаБезСкидки 	= БезСкидкиИтого;
				КонецЕсли;
				Если ЕстьПараметрОбласти(ОбластьИтого.Параметры, "СуммаСкидки") Тогда
					ОбластьИтого.Параметры.СуммаСкидки 		= СкидкаИтого;
				КонецЕсли;
				Если ЕстьПараметрОбласти(ОбластьИтого.Параметры, "ВсегоНДС") Тогда
					ОбластьИтого.Параметры.ВсегоНДС 		= НДСИтого;
				КонецЕсли;
				Если ЕстьПараметрОбласти(ОбластьИтого.Параметры, "Сумма") Тогда
					ОбластьИтого.Параметры.Сумма 			= БезСкидкиИтого - СкидкаИтого;
				КонецЕсли;
				ТабДокумент.Вывести(ОбластьИтого);
			КонецЕсли;
		Иначе
			
			Если Макет.Области.Найти("ШапкаТаблицы") <> Неопределено Тогда
				ОбластьМакета 		      = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			СумИтого = 0;
			НДСИтого = 0;
			Таблица = Новый ТаблицаЗначений; 
			ОписаниеКоличество = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3));
			Таблица.Колонки.Добавить("Зуб");
			Таблица.Колонки.Добавить("Номенклатура");
			Таблица.Колонки.Добавить("Количество", ОписаниеКоличество);
			Таблица.Колонки.Добавить("Цена", ОписаниеКоличество);
			Таблица.Колонки.Добавить("Сумма", ОписаниеКоличество);
			Таблица.Колонки.Добавить("СуммаНДС", ОписаниеКоличество);
			Таблица.Колонки.Добавить("СтавкаНДС");
			Таблица.Колонки.Добавить("НомерПриема");
			Таблица.Колонки.Добавить("Артикул");
			ВыборкаИтог = ЗапросУслуги.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаИтог.Следующий() Цикл		
				
				ВыборкаНоменклатура = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Если Макет.Области.Найти("НомерПриемаМед") <> Неопределено Тогда
					ОбластьНомерСтроки        = Макет.ПолучитьОбласть("НомерПриемаМед");
					ОбластьНомерСтроки.Параметры.Заполнить(ВыборкаНоменклатура);
					Если ЕстьПараметрОбласти(ОбластьНомерСтроки.Параметры, "НомерПриема") Тогда
						ОбластьНомерСтроки.Параметры.НомерПриема = ?(ВыборкаИтог.НомерПриема <> 0, "" + ВыборкаИтог.НомерПриема + " посещение", "");
					КонецЕсли;
					Если ЕстьПараметрОбласти(ОбластьНомерСтроки.Параметры, "Сумма") Тогда
						ОбластьНомерСтроки.Параметры.Сумма = ?(ВыборкаИтог.Сумма <> 0, Формат(ВыборкаИтог.Сумма, "ЧЦ=15; ЧДЦ=2; ЧН=0,00"),"");
					КонецЕсли;
					ТабДокумент.Вывести(ОбластьНомерСтроки, ВыборкаИтог.Уровень());	
				КонецЕсли;
				
				Пока ВыборкаНоменклатура.Следующий() Цикл
					
					НоваяСтрока             	= Таблица.Добавить();
					НоваяСтрока.Артикул 		= ВыборкаНоменклатура.Артикул;
					НоваяСтрока.Номенклатура 	= ВыборкаНоменклатура.Номенклатура;
					НоваяСтрока.Количество   	= ВыборкаНоменклатура.Количество;
					НоваяСтрока.Сумма   		= ВыборкаНоменклатура.Сумма;
					НоваяСтрока.Цена   			= ВыборкаНоменклатура.Сумма / ?(ВыборкаНоменклатура.Количество <> 0, ВыборкаНоменклатура.Количество, 1);
					НоваяСтрока.СуммаНДС   		= ВыборкаНоменклатура.СуммаНДС;
					ВыборкаСтавкаНДС = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСтавкаНДС.Следующий() Цикл
						НоваяСтрока.СтавкаНДС = ВыборкаСтавкаНДС.СтавкаНДС;
					КонецЦикла;
					
					Если НоваяСтрока.СуммаНДС = 0 Тогда
						НоваяСтрока.СтавкаНДС = "Без НДС";
					КонецЕсли;
					
					НДСИтого = НДСИтого + ВыборкаНоменклатура.СуммаНДС;
					СумИтого = СумИтого + ВыборкаНоменклатура.Сумма;
					ВыборкаЗубы = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.Прямой);			
					СписокЗначений = Новый СписокЗначений;
					
					Пока ВыборкаЗубы.Следующий() Цикл
						
						СписокЗначений.Добавить(Строка(ВыборкаЗубы.Зуб));				
						
					КонецЦикла;
					
					СписокЗначений.СортироватьПоЗначению();
					Зубы = "";
					Разделитель = "";
					
					Для Каждого СтрокаСЗ ИЗ СписокЗначений Цикл
						
						Зубы = Зубы + Разделитель + СтрокаСЗ.Значение;
						Разделитель = ",";				
						
					КонецЦикла;  			
					
					НоваяСтрока.Зуб = Зубы;
						
					Если Макет.Области.Найти("Номенклатура") <> Неопределено Тогда
						ОбластьНоменклатура       = Макет.ПолучитьОбласть("Номенклатура");
						
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Количество") Тогда
							ОбластьНоменклатура.Параметры.Количество 	= НоваяСтрока.Количество;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Зуб") Тогда
							ОбластьНоменклатура.Параметры.Зуб 			= НоваяСтрока.Зуб;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Номенклатура") Тогда
							ОбластьНоменклатура.Параметры.Номенклатура 	= ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура.НаименованиеПолное),НоваяСтрока.Номенклатура.НаименованиеПолное, НоваяСтрока.Номенклатура);
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Цена") Тогда
							ОбластьНоменклатура.Параметры.Цена 			= НоваяСтрока.Цена;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Сумма") Тогда
							ОбластьНоменклатура.Параметры.Сумма 		= НоваяСтрока.Сумма;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "СуммаНДС") Тогда
							ОбластьНоменклатура.Параметры.СуммаНДС 		= НоваяСтрока.СуммаНДС;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "СтавкаНДС") Тогда
							ОбластьНоменклатура.Параметры.СтавкаНДС 	= НоваяСтрока.СтавкаНДС;
						КонецЕсли;
						Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Артикул") Тогда
							ОбластьНоменклатура.Параметры.Артикул 		= НоваяСтрока.Артикул;
						КонецЕсли;
						
						ТабДокумент.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла; 
			
			Если Макет.Области.Найти("ИтогоНДС") <> Неопределено Тогда
				ОбластьИтогоНДС           = Макет.ПолучитьОбласть("ИтогоНДС"); 
				
				Если ЕстьПараметрОбласти(ОбластьИтогоНДС.Параметры, "ВсегоНДС") Тогда
					ОбластьИтогоНДС.Параметры.ВсегоНДС = НДСИтого;
				КонецЕсли;
				Если ЕстьПараметрОбласти(ОбластьИтогоНДС.Параметры, "Сумма") Тогда
					ОбластьИтогоНДС.Параметры.Сумма = СумИтого;
				КонецЕсли;
				ТабДокумент.Вывести(ОбластьИтогоНДС);
			КонецЕсли;
		КонецЕсли;
		
		Если Макет.Области.Найти("СуммаПрописью") <> Неопределено Тогда
			ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью"); 
			ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока     = "Лечение на сумму: " + ФормированиеПечатныхФорм.СуммаРубКоп(СумИтого,,);// ФормированиеПечатныхФорм.СуммаРубКоп(Прием_Шапка.ОбщееИтогоСоСкидкой, ,);// Формат(ТаблицаУслуги.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=") + " руб." ;
			ОбластьСуммаПрописью.Параметры.СуммаПрописью      = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СумИтого); // Прием_Шапка.ОбщееИтогоСоСкидкой
			ТабДокумент.Вывести(ОбластьСуммаПрописью);
		КонецЕсли;	
		
		Если Макет.Области.Найти("Подвал") <> Неопределено Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			Таблица       = ВернутьФИООтветственныеЛицаОрганизации(Объект.СтруктурнаяЕдиница.Организация);	
			Бухгалтер     = Таблица.НАйти(Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер, "ТипОтветственногоЛица");
			Руководитель  = Таблица.НАйти(Перечисления.ТипыОтветственныхЛиц.Руководитель    , "ТипОтветственногоЛица");		
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ФИОБухгалтера") Тогда
				ОбластьМакета.Параметры.ФИОБухгалтера = ?(Бухгалтер <> Неопределено   , Бухгалтер.ФИО, "");
			КонецЕсли;
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ФИОРуководителя") Тогда
				ОбластьМакета.Параметры.ФИОРуководителя   = ?(Руководитель <> Неопределено, Руководитель.ФИО, "");	
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		Если Макет.Области.Найти("ПодвалЗаказа") <> Неопределено Тогда
			ОбластьМакета                          = Макет.ПолучитьОбласть("ПодвалЗаказа");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ФИОИсполнителя") Тогда
				ОбластьМакета.Параметры.ФИОИсполнителя = Объект.Сотрудник;
			КонецЕсли;
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ФИОЗаказчика") Тогда
				ОбластьМакета.Параметры.ФИОЗаказчика   = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), "ПолноеНаименование,");
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		Если Макет.Области.Найти("Комментарий") <> Неопределено Тогда
			ОбластьМакета                       = Макет.ПолучитьОбласть("Комментарий");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "Комментарий") Тогда
				ОбластьМакета.Параметры.Комментарий = Объект.Комментарий;
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;	
		КонецЕсли;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ
// Функция, возвращающая табличный документ "Счет на оплату" для печати
//
Функция СформироватьПечатнуюФормуПланЛеченияМедицинский(МассивОбъектов, ОбъектыПечати)
	
	Если ИспользуетсяПользовательскийМакет("ПФ_MXL_ПланЛеченияМед") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание используется пользовательский макет печати. Рекомендуется использовать оригинальный макет.");
	КонецЕсли;

	ТабДокумент                     = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_MXL_ПланЛеченияМед";
	Макет                           = УправлениеПечатью.МакетПечатнойФормы("Документ.ПланЛечения.ПФ_MXL_ПланЛеченияМед");
	
	ПервыйДокумент    = Истина;
	
	Для Каждого Объект Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;	
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ЭтоСтоматологическиеУслуги = ОбщегоНазначенияСтоматология.ПолучитьПризнакОказанияСтоматологическихУслуг(Объект.Сотрудник); 
		
		ЗапросШапка = Новый Запрос;
		ЗапросШапка.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
		ЗапросШапка.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплату.Номер КАК Номер,
		|	СчетНаОплату.Дата КАК Дата,
		|	СчетНаОплату.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
		|	СчетНаОплату.СуммаДокумента КАК СуммаДокумента,
		|	СчетНаОплату.СтруктурнаяЕдиница.Организация КАК Организация,
		|	СчетНаОплату.Контрагент КАК Получатель,
		|	СчетНаОплату.Сотрудник КАК Поставщик,
		|	СчетНаОплату.Ссылка
		|ИЗ
		|	Документ.ПланЛечения КАК СчетНаОплату
		|ГДЕ
		|	СчетНаОплату.Ссылка = &ТекущийДокумент";
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ЗапросУслуги = Новый Запрос;
		ЗапросУслуги.УстановитьПараметр("Ссылка", Объект.Ссылка);
		ЗапросУслуги.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПланЛеченияЛечение.Зуб КАК Зуб,
		|	ПланЛеченияЛечение.Номенклатура КАК Номенклатура,
		|	СУММА(ПланЛеченияЛечение.Количество) КАК Количество,
		|	ПланЛеченияЛечение.НомерПриема КАК НомерПриема,
		|	ПланЛеченияЛечение.Номенклатура.КодНоменклатурыМедицинскиУслуг КАК Артикул,
		|	ПланЛеченияЛечение.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ПланЛечения.Лечение КАК ПланЛеченияЛечение
		|ГДЕ
		|	ПланЛеченияЛечение.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланЛеченияЛечение.Зуб,
		|	ПланЛеченияЛечение.Номенклатура,
		|	ПланЛеченияЛечение.НомерПриема,
		|	ПланЛеченияЛечение.Номенклатура.Артикул,
		|	ПланЛеченияЛечение.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|   Зуб 
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	НомерПриема,
		|	Номенклатура";
		
		ВыборкаТаблицаЛечение 	= ЗапросУслуги.Выполнить();
	
		// Вывод реквизитов организации
		Если Макет.Области.Найти("РеквизитыОрганизации") <> Неопределено Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыОрганизации");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ПредставлениеОрганизации") Тогда  
				ПолноеПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,");
				ПредставлениеОрганизации       = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Шапка.Организация, "Наименование");
				ОбластьМакета.Параметры.ПредставлениеОрганизации = ?(ЗначениеЗаполнено(ПолноеПредставлениеОрганизации), ПолноеПредставлениеОрганизации, ПредставлениеОрганизации); 
			КонецЕсли;
			
			ФактАдрес = Шапка.Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, "Вид");
			ЮрАдрес   = Шапка.Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Вид");
			
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "АдресОрганизации") Тогда 
				
				Если НЕ ФактАдрес = Неопределено Тогда
					Адрес = ФактАдрес.Представление;
				ИначеЕсли НЕ ЮрАдрес = Неопределено Тогда
					Адрес = ЮрАдрес.Представление;
				КонецЕсли;
				
				ОбластьМакета.Параметры.АдресОрганизации = ?(ЗначениеЗаполнено(Адрес), Адрес, ""); 
				
			КонецЕсли;                                                                              
			
			ТабДокумент.Вывести(ОбластьМакета);                                                     			
			
		КонецЕсли;

		ВидыВыводимойКИ = Новый Массив;
		ВидыВыводимойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		ВидыВыводимойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации);
		ВидыВыводимойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
		
		Для Каждого ВидКонтактнойИнформации Из ВидыВыводимойКИ Цикл		
			СтрокаКИ =  Шапка.Организация.КонтактнаяИнформация.Найти(ВидКонтактнойИнформации, "Вид");		
			Если СтрокаКИ <> Неопределено Тогда
				Если Макет.Области.Найти("СтрокаКИ") <> Неопределено Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКИ");
					Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ВидКИ") Тогда
						ОбластьМакета.Параметры.ВидКИ = СтрокаКИ.Вид;
					КонецЕсли;
					Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ПредставлениеКИ") Тогда
						ОбластьМакета.Параметры.ПредставлениеКИ = СокрП(СтрокаКИ.Представление);				
					КонецЕсли;
					ТабДокумент.Вывести(ОбластьМакета);			
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;
		// ***
		Если Макет.Области.Найти("Заголовок") <> Неопределено Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ТекстЗаголовка") Тогда
				ОбластьМакета.Параметры.ТекстЗаголовка = "План лечения № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс) + " от " + Формат(Шапка.Дата, "ДФ='дд ММММ гггг'") + " г.";
			КонецЕсли;	
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;			
		Если Макет.Области.Найти("Покупатель") <> Неопределено Тогда             
			ОбластьМакета           = Макет.ПолучитьОбласть("Покупатель"); 	
			ПредставлениеПолучателя = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Шапка.Получатель, "Наименование");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ПредставлениеПолучателя") Тогда
				ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
			КонецЕсли;			
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
		Если Макет.Области.Найти("Составитель") <> Неопределено Тогда
			ОбластьМакета                                    = Макет.ПолучитьОбласть("Составитель");
			ПредставлениеСоставителя                         = Объект.Сотрудник;
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ПредставлениеСоставителя") Тогда
				ОбластьМакета.Параметры.ПредставлениеСоставителя = ПредставлениеСоставителя;
			КонецЕсли;			
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
		//===================================================ВЫВОД ТАБЛИЦЫ ЛЕЧЕНИЕ=======================================================	
		Если Макет.Области.Найти("ШапкаТаблицыМед") <> Неопределено Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыМед");
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
		
		КолИтого = 0;
		Таблица = Новый ТаблицаЗначений;
		ОписаниеКоличество = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3));
		Таблица.Колонки.Добавить("Зуб");
		Таблица.Колонки.Добавить("Номенклатура");
		Таблица.Колонки.Добавить("Количество", ОписаниеКоличество);
		Таблица.Колонки.Добавить("НомерПриема");
		Таблица.Колонки.Добавить("Артикул");
		ВыборкаИтог = ЗапросУслуги.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаИтог.Следующий() Цикл
			
			ВыборкаНоменклатура = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если Макет.Области.Найти("НомерПриемаМед") <> Неопределено Тогда
				ОбластьНомерСтроки = Макет.ПолучитьОбласть("НомерПриемаМед");
				ОбластьНомерСтроки.Параметры.Заполнить(ВыборкаНоменклатура);
				Если ЕстьПараметрОбласти(ОбластьНомерСтроки.Параметры, "НомерПриема") Тогда
					ОбластьНомерСтроки.Параметры.НомерПриема = ?(ВыборкаИтог.НомерПриема <> 0, "" + ВыборкаИтог.НомерПриема + " посещение", "");	
				КонецЕсли;
				ТабДокумент.Вывести(ОбластьНомерСтроки, ВыборкаИтог.Уровень());
			КонецЕсли;
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				НоваяСтрока             	= Таблица.Добавить();
				НоваяСтрока.Артикул 		= ВыборкаНоменклатура.Артикул;
				НоваяСтрока.Номенклатура 	= ВыборкаНоменклатура.Номенклатура;
				НоваяСтрока.Количество   	= ВыборкаНоменклатура.Количество;
				КолИтого = КолИтого + ВыборкаНоменклатура.Количество;
				ВыборкаЗубы = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.Прямой);
				СписокЗначений = Новый СписокЗначений;
				
				Пока ВыборкаЗубы.Следующий() Цикл
					
					СписокЗначений.Добавить(Строка(ВыборкаЗубы.Зуб));
					
				КонецЦикла;
				
				СписокЗначений.СортироватьПоЗначению();
				Зубы = "";
				Разделитель = "";
				
				Для Каждого СтрокаСЗ ИЗ СписокЗначений Цикл
					
					Зубы = Зубы + Разделитель + СтрокаСЗ.Значение;
					Разделитель = ",";				
					
				КонецЦикла;  			
				
				НоваяСтрока.Зуб = Зубы;
				
				Если Макет.Области.Найти("НоменклатураМед") <> Неопределено Тогда
					
					ОбластьНоменклатура = Макет.ПолучитьОбласть("НоменклатураМед");
					Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Количество") Тогда
						ОбластьНоменклатура.Параметры.Количество 	= НоваяСтрока.Количество;
					КонецЕсли;
					Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Зуб") Тогда
						ОбластьНоменклатура.Параметры.Зуб 			= НоваяСтрока.Зуб;
					КонецЕсли;
					Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Номенклатура") Тогда
						ОбластьНоменклатура.Параметры.Номенклатура 	= ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура.НаименованиеПолное),НоваяСтрока.Номенклатура.НаименованиеПолное, НоваяСтрока.Номенклатура);
					КонецЕсли;
					Если ЕстьПараметрОбласти(ОбластьНоменклатура.Параметры, "Артикул") Тогда
						ОбластьНоменклатура.Параметры.Артикул 		= НоваяСтрока.Артикул;
					КонецЕсли;
					ТабДокумент.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
				КонецЕсли;

			КонецЦикла;
			
		КонецЦикла;  
		
		Если Макет.Области.Найти("Итого") <> Неопределено Тогда
			ОбластьИтого        = Макет.ПолучитьОбласть("Итого");
			Если ЕстьПараметрОбласти(ОбластьИтого.Параметры, "Количество") Тогда
				ОбластьИтого.Параметры.Количество = КолИтого;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьИтого);
		КонецЕсли;
		
		Если Макет.Области.Найти("Подвал") <> Неопределено Тогда
			ОбластьМакета                             = Макет.ПолучитьОбласть("Подвал");
			Таблица                                   = ВернутьФИООтветственныеЛицаОрганизации(Объект.СтруктурнаяЕдиница.Организация);	
			Бухгалтер                                 = Таблица.НАйти(Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер, "ТипОтветственногоЛица");
			Руководитель                              = Таблица.НАйти(Перечисления.ТипыОтветственныхЛиц.Руководитель    , "ТипОтветственногоЛица");		
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ФИОБухгалтера") Тогда
				ОбластьМакета.Параметры.ФИОБухгалтера     = ?(Бухгалтер <> Неопределено   , Бухгалтер.ФИО, "");
			КонецЕсли;
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ФИОРуководителя") Тогда
				ОбластьМакета.Параметры.ФИОРуководителя   = ?(Руководитель <> Неопределено, Руководитель.ФИО, "");	
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		Если Макет.Области.Найти("ПодвалЗаказа") <> Неопределено Тогда
			ОбластьМакета                          = Макет.ПолучитьОбласть("ПодвалЗаказа");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ФИОИсполнителя") Тогда
				ОбластьМакета.Параметры.ФИОИсполнителя = Объект.Сотрудник;
			КонецЕсли;
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "ФИОЗаказчика") Тогда
				ОбластьМакета.Параметры.ФИОЗаказчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), "ПолноеНаименование,");			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		Если Макет.Области.Найти("Комментарий") <> Неопределено Тогда
			ОбластьМакета                       = Макет.ПолучитьОбласть("Комментарий");
			Если ЕстьПараметрОбласти(ОбластьМакета.Параметры, "Комментарий") Тогда
				ОбластьМакета.Параметры.Комментарий = Объект.Комментарий;
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		КонецЕсли;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;
	
КонецФункции

Функция ЕстьПараметрОбласти(Область, ИмяПараметра) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	
	СтруктураРеквизита = Новый Структура(ИмяПараметра, КлючУникальности);
	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Область);
	
	Возврат СтруктураРеквизита[ИмяПараметра] <> КлючУникальности;
	
КонецФункции 

// Только для внутреннего использования.
//
Функция ИспользуетсяПользовательскийМакет(ИмяМакета)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПользовательскиеМакетыПечати.ИмяМакета
	|ИЗ
	|	РегистрСведений.ПользовательскиеМакетыПечати КАК ПользовательскиеМакетыПечати
	|ГДЕ
	|	ПользовательскиеМакетыПечати.Использование = ИСТИНА
	|	И ПользовательскиеМакетыПечати.ИмяМакета = &ИмяМакета";
	
	Запрос.УстановитьПараметр("ИмяМакета", ИмяМакета);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() >0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("ПФ_MXL_ГарантийныйТалон", "Гарантийный талон", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_Квитанция", "Квитанция об оплате", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_ПланЛеченияМед", "План лечения (медицинский)", , БиблиотекаКартинок.Документ);
	Список.Добавить("ПФ_MXL_ПланЛечения", "План лечения (финансовый)", , БиблиотекаКартинок.Документ);	

	Возврат Список;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
